import React, { Component } from 'react';
import '../style/css/DeliveryAndPayStyle.css';
import { Link } from 'react-router-dom';

export default class DeliveryAndPay extends Component {
  render() {
    return (
      <div className='deliveryAndPay'>
        <div className='info'>
          <nav aria-label='breadcrumb'>
            <ol class='breadcrumb'>
              <li class='breadcrumb-item'>
                <Link className='breadcrumb-link' to='/'>
                  Argentum Jewelry
                </Link>
              </li>
              <li class='breadcrumb-item active' aria-current='page'>
                Доставка та оплата
              </li>
            </ol>
          </nav>
          <h3>Доставка</h3>
          <p>
            Інтернет магазин "Argentum Jewelry" здійснює доставку срібних
            виробів по всій Україні. Отримати замовлення ви можете у будь-якому
            відділенні транспортної компанії “Нова пошта”, розташованому у
            безпосередній близькості до вашого будинку. Також можна замовити
            адресну доставку, і тоді товар буде привезений кур’єром у
            встановлене вами місце.
          </p>
          <p>
            Оплата доставки здійснюється під час отримання замовлення. Якщо сума
            замовлення 800 грн або більше, доставка безкоштовна.
          </p>
          <p>
            Середній час доставки посилки по Україні – 1-3 дні. Детальнішу
            інформацію ви зможете уточнити у нашого менеджера або самостійно
            розрахувати на сайті “Нової пошти” у відповідному розділі, вказавши
            населений пункт прибуття товару.
          </p>

          <h3>Оплата</h3>
          <p>При оформленні замовленння є пункт вибору способу оплати.</p>
          <p>Магазин пропонує 2 методи оплати:</p>
          <ul>
            <li>при отриманні у відділенні "Нової Пошти"</li>
            <li>
              на картку - реквізити будуть надіслані на пошту після оформлення
              замовлення
            </li>
          </ul>

          <p>
            У разі вибору оплати при отриманні потрібно оплатити комісію у
            розмірі 20 грн за грошовий переказ і додати до загальної суми
            замовлення 2%. Це відбувається згідно з вимогами транспортної
            компанії “Нова пошта”.
          </p>
        </div>
      </div>
    );
  }
}
